
Tasks:
Display the first few records of the dataset and confirm that the DataFrame is correctly created. (4 Marks)


Use the groupby() function to calculate the total sales made by each salesperson. Display the result in descending order of total sales. (6 Marks)


Group the data by Region and compute the average sales per region. (10 Marks)

In [1]:
import pandas as pd

In [2]:
data = {

    'Salesperson': ['Alice', 'Bob', 'Alice', 'Diana', 'Bob', 'Ethan', 'Alice', 'Diana', 'Ethan', 'Bob'],

    'Region': ['Nairobi', 'Mombasa', 'Kisumu', 'Nairobi', 'Nairobi', 'Kisumu', 'Mombasa', 'Kisumu', 'Nairobi', 'Mombasa'],

    'Sales': [25000, 18000, 22000, 27000, 15000, 20000, 30000, 23000, 24000, 16000]

}

df = pd.DataFrame(data)

In [3]:
df.head()

  Salesperson   Region  Sales
0       Alice  Nairobi  25000
1         Bob  Mombasa  18000
2       Alice   Kisumu  22000
3       Diana  Nairobi  27000
4         Bob  Nairobi  15000

In [4]:
df

  Salesperson   Region  Sales
0       Alice  Nairobi  25000
1         Bob  Mombasa  18000
2       Alice   Kisumu  22000
3       Diana  Nairobi  27000
4         Bob  Nairobi  15000
5       Ethan   Kisumu  20000
6       Alice  Mombasa  30000
7       Diana   Kisumu  23000
8       Ethan  Nairobi  24000
9         Bob  Mombasa  16000

#### Use the groupby() function to calculate the total sales made by each salesperson. Display the result in descending order of total sales. (6 Marks)

In [5]:
data=df.groupby('Salesperson')['Sales'].sum().reset_index().sort_values(by='Sales', ascending=False)
data

  Salesperson  Sales
0       Alice  77000
2       Diana  50000
1         Bob  49000
3       Ethan  44000

#### Group the data by Region and compute the average sales per region. (10 Marks)

In [6]:
df.groupby('Region')['Sales'].mean().reset_index()

    Region         Sales
0   Kisumu  21666.666667
1  Mombasa  21333.333333
2  Nairobi  22750.000000